# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

# *Пример:*

# ноутбук
#     12

points = {"A": 1, "E": 1, "I": 1, "O": 1, "U": 1, "L": 1, "N": 1, "S": 1, "T": 1, "R": 1, "D": 2, "G": 2, "B": 3, "C": 3, "M": 3, "P": 3,  "F": 4, "H": 4, "V": 4, "W": 4, "Y": 4, "K": 5, "J": 8, "X": 8, "Q": 10, "Z": 10}

word = str(input('Type in your word: '))
score = 0
for letter in word.upper():
    for letters in points.keys():
        if letter in letters:
            score+=points.get(letters)
            print(score)
            break
print (score)
# for i in word.lower():
#     print(word(points))
# print(score)

# score = {"a": 1, "c": 3, "b": 3, "e": 1, "d": 2, "g": 2, 
#          "f": 4, "i": 1, "h": 4, "k": 5, "j": 8, "m": 3, 
#          "l": 1, "o": 1, "n": 1, "q": 10, "p": 3, "s": 1, 
#          "r": 1, "u": 1, "t": 1, "w": 4, "v": 4, "y": 4, 
#          "x": 8, "z": 10}

# def scrabble_score(word):
#     total = 0
#     for i in word:
#         total = total+score[i.lower()]
#     return total

# print scrabble_score("POTATOES")


# points = [{"A":1}, {"E":1}, {"I":1}, {"O":1}, {"U":1}, {"L":1}, {"N":1}, {"S":1},
#                    {"T":1},{"R":1}, {'D':2}, {'G':2}, {'B':3},{ 'C':3}, {'M':3}, {'P':3},
#                    {'F':4}, {'H':4}, {'V':4}, {'W':4}, {'Y': 4}, {'K':5}, {'J':8}, {'X': 8},{'Q':10}, {'Z': 10}]